app/controllers/corsairs_controller.rb

  def index
    @corsairs = Corsair.all
---
SELECT "corsairs".* FROM "corsairs"

  def show
    @corsair = Corsair.find(params[:id])
---
SELECT  "corsairs".* FROM "corsairs" WHERE "corsairs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @corsair = Corsair.find(params[:id])
---
SELECT  "corsairs".* FROM "corsairs" WHERE "corsairs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @corsair = Corsair.find(params[:id])
    new_corsair = corsair_params
    if @corsair.update(new_corsair)
---
SELECT  "corsairs".* FROM "corsairs" WHERE "corsairs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "corsairs" SET "likeness" = ?, "updated_at" = ? WHERE "corsairs"."id" = ?  [["likeness", "kebab"], ["updated_at", "2018-01-31 21:22:31.994640"], ["id", 1]]

  def create
    @corsair = Corsair.new(corsair_params)
    if @corsair.save
---
INSERT INTO "corsairs" ("first_name", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Adrien"], ["age", 19], ["created_at", "2018-01-31 21:22:07.622917"], ["updated_at", "2018-01-31 21:22:07.622917"]]